<!-- Projeto Desenvolvido na Data Science Academy - www.datascienceacademy.com.br -->
# <font color='blue'>Data Science Academy</font>
## <font color='blue'>Automação de Processos e Engenharia de Dados com Python, Excel e IA</font>
## <font color='blue'>Exercícios</font>

## Pacotes Python Usados no Projeto

In [1]:
# Instala o pacote watermark
!pip install -q -U watermark

In [2]:
# Imports
import pandas as pd

In [3]:
%reload_ext watermark
%watermark -a "Data Science Academy"

Author: Data Science Academy

Neste exercício você vai praticar suas habilidades de pesquisa e estudar a função pivot.

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.pivot.html

Então considere o dataframe abaixo e crie o código Python que gera as 5 tabelas pivot a seguir. Compare suas respostas com o gabarito fornecido.

In [4]:
# Dataframe
df = pd.DataFrame({
    'Montadora': ['Porsche', 'Honda', 'Toyota', 'BMW', 'Porsche', 'Honda', 'Toyota', 'BMW'],
    'Localidade': ['EUA', 'EUA', 'EUA', 'EUA', 'Alemanha', 'Alemanha', 'Alemanha', 'Alemanha'],
    'Modelo':['Taycan', 'Civic', 'Corolla', 'Z4', 'Macan', 'Accord', 'Camry', 'X3'],
    'Unidades_Vendidas': [97, 75, 84, 92, 120, 98, 76, 81]})

In [5]:
df

  Montadora Localidade   Modelo  Unidades_Vendidas
0   Porsche        EUA   Taycan                 97
1     Honda        EUA    Civic                 75
2    Toyota        EUA  Corolla                 84
3       BMW        EUA       Z4                 92
4   Porsche   Alemanha    Macan                120
5     Honda   Alemanha   Accord                 98
6    Toyota   Alemanha    Camry                 76
7       BMW   Alemanha       X3                 81

In [6]:
# Tabela Pivot 1

In [7]:
# Tabela Pivot 2

In [8]:
# Tabela Pivot 3

In [9]:
# Tabela Pivot 4

In [10]:
# Tabela Pivot 5

In [11]:
%reload_ext watermark
%watermark -a "Data Science Academy"

Author: Data Science Academy

In [12]:
#%watermark

In [13]:
#%watermark --iversions

# Fim